# (a) Find a DCC Professor who has (co)authored at least one paper with a professor working in Kōfu, Japan.

# Paso 1:

Identificar todas las universidades de Kōfu, Japón en el endpoint de Wikidata https://query.wikidata.org/:

SELECT DISTINCT ?university ?universityLabel WHERE {
  ?university wdt:P31 wd:Q3918 ;       # instancia de universidad
              wdt:P131* wd:Q201932 .   # ubicada en Kōfu
  SERVICE wikibase:label { bd:serviceParam wikibase:language "en". }
}

Esto permite identificar la existencia de "University of Yamanashi"

# Paso 2:

Realizar un webscraping en la página web https://www.dcc.uchile.cl/profesores_dcc ,a través de la consola del explorador con JS se identifican los nombres en el elemento HTML de la página en este caso p.nombre:

const elementos = document.querySelectorAll('p.nombre');

let csvContent = "ID,Nombre\n";

elementos.forEach((elemento, index) => {
  const id = index + 1; // ID comienza en 1
  const nombre = elemento.textContent.trim().replace(/"/g, '""'); 
  csvContent += `"${id}","${nombre}"\n`;
});

const blob = new Blob([csvContent], { type: 'text/csv;charset=utf-8;' });

const link = document.createElement('a');
const url = URL.createObjectURL(blob);
link.setAttribute('href', url);
link.setAttribute('download', 'nombres.csv');
link.style.visibility = 'hidden';

document.body.appendChild(link);
link.click();

document.body.removeChild(link);

Resultando un .csv con la lista de nombres en la página

| ID | Nombre                      |
|----|-----------------------------|
| 1  | Andrés Abeliuk              |
| 2  | Ivana Bachmann E.           |
| 3  | Nelson Baloian              |
| 4  | Valentin Barriere           |
| 5  | María Cecilia Bastarrica    |
| 6  | Felipe Bravo Márquez        |
| 7  | Benjamín Bustos             |
| 8  | Eduardo Graells-Garrido     |
| 9  | Claudio Gutiérrez           |
| 10 | Francisco J. Gutiérrez      |
| 11 | Alejandro Hevia             |
| 12 | Nancy Hitschfeld            |
| 13 | Aidan Hogan                 |
| 14 | Gonzalo Navarro             |
| 15 | Sergio Ochoa                |
| 16 | Federico Olmedo             |
| 17 | Patricio Poblete            |
| 18 | Jocelyn Simmonds            |
| 19 | Iván Sipirán                |
| 20 | Éric Tanter                 |
| 21 | Matías Toro                 |


#3

Con la lista obtenida del webscraping, se busca en DBLP Sparql https://sparql.dblp.org/ si existe alguna coincidencia de nombres de los profesores DCC que tengan en afiliación en "University of Chile"

PREFIX dblp: <https://dblp.org/rdf/schema#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>

SELECT DISTINCT ?authorIRI ?authorName ?affiliation WHERE {
  ?authorIRI a dblp:Person ;
          rdfs:label ?authorName ;
          dblp:primaryAffiliation ?affiliation .

  FILTER(CONTAINS(STR(?affiliation), "University of Chile"))

  FILTER(
    regex(?authorName, "Abeliuk") ||
    regex(?authorName, "Bachmann") ||
    regex(?authorName, "Baloian") ||
    regex(?authorName, "Barriere") ||
    regex(?authorName, "Bastarrica") ||
    regex(?authorName, "Bravo") ||
    regex(?authorName, "Bustos") ||
    regex(?authorName, "Graells") ||
    regex(?authorName, "Claudio Gutiérrez") ||
    regex(?authorName, "Francisco.*Gutiérrez") ||
    regex(?authorName, "Hevia") ||
    regex(?authorName, "Hitschfeld") ||
    regex(?authorName, "Aidan Hogan") ||
    regex(?authorName, "Gonzalo Navarro") ||
    regex(?authorName, "Sergio Ochoa") ||
    regex(?authorName, "Olmedo") ||
    regex(?authorName, "Poblete") ||
    regex(?authorName, "Simmonds") ||
    regex(?authorName, "Sipirán") ||
    regex(?authorName, "Tanter") ||
    regex(?authorName, "Matías Toro")
  )
}
LIMIT 100

Resultando esto:

| # | ?authorIRI             | ?authorName              | ?affiliation                                         |
|---|------------------------|--------------------------|------------------------------------------------------|
| 1 | 5056                   | Benjamin Bustos          | University of Chile, Department of Computer Scie[...] |
| 2 | 1093                   | Javier Bustos-Jiménez    | University of Chile, NIC Chile Research Labs, Sa[...] |
| 3 | 7397                   | Federico Olmedo          | University of Chile, Chile                           |
| 4 | 6509                   | Barbara Poblete          | University of Chile                                  |
| 5 | MCeciliaBastarrica     | M. Cecilia Bastarrica    | University of Chile, Santiago, Chile                 |
| 6 | AlejandroHevia         | Alejandro Hevia          | University of Chile, Santiago, Chile                 |
| 7 | NancyHitschfeldKahler  | Nancy Hitschfeld-Kahler  | University of Chile, Santiago, Chile                 |
| 8 | GonzaloNavarro         | Gonzalo Navarro 0001     | University of Chile, Santiago, Chile                 |
| 9 | EricTanter             | Éric Tanter              | University of Chile, Santiago, Chile                 |

#4

Identificadas las IRIS presentes, se busca la coautoría, filtrando si esa coautoría es de "University of Yamanashi"

PREFIX dblp: <https://dblp.org/rdf/schema#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>

SELECT DISTINCT 
  ?dccAuthor ?dccAuthorName ?dccAffiliation 
  ?coauthor ?coauthorName ?coauthorAffiliation 
WHERE {
  VALUES ?dccAuthor {
    <https://dblp.org/pid/t/EricTanter>
    <https://dblp.org/pid/n/GonzaloNavarro>
    <https://dblp.org/pid/h/NancyHitschfeldKahler>
    <https://dblp.org/pid/h/AlejandroHevia>
    <https://dblp.org/pid/b/MCeciliaBastarrica>
    <https://dblp.org/pid/83/6509>
    <https://dblp.org/pid/79/7397>
    <https://dblp.org/pid/26/1093>
    <https://dblp.org/pid/15/5056>
  }

  ?pub dblp:authoredBy ?dccAuthor, ?coauthor .
  FILTER (?dccAuthor != ?coauthor)

  ?dccAuthor rdfs:label ?dccAuthorName .
  OPTIONAL { ?dccAuthor dblp:primaryAffiliation ?dccAffiliation . }

  ?coauthor rdfs:label ?coauthorName .
  OPTIONAL { ?coauthor dblp:primaryAffiliation ?coauthorAffiliation . }

  FILTER(CONTAINS(STR(?coauthorAffiliation), "University of Yamanashi"))
}
ORDER BY ?dccAuthorName ?coauthorName

Resultando 2 autores que tienen el criterio de, ser del DCC teniendo coautoria de alguien de una universidad en Kōfu Japón.

| # | DCC Author PID | DCC Author Name         | DCC Affiliation                                   | Coauthor PID | Coauthor Name         | Coauthor Affiliation                        |
|---|---------------|------------------------|---------------------------------------------------|--------------|----------------------|---------------------------------------------|
| 1 | 15/5056       | Benjamin Bustos        | University of Chile, Department of Computer Science| 5120-3       | Takahiro Matsuda 0003 | University of Yamanashi, Graduate School of Medicine |
| 2 | 79/7397       | Gonzalo Navarro 0001   | University of Chile, Santiago, Chile               | 9119         | Dominik Köppl        | University of Yamanashi, Kofu, Japan        |

Benjamín Bustos y Gonzalo Navarro tienen coautorías con autores que trabajan en una universidad en Kōfu, Japón.
